Revit 2027 API
DirectShapeType.AddReferencePlane(Plane, DirectShapeReferenceOptions) Method
 Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddReferencePlane(
	Plane refPlane,
	DirectShapeReferenceOptions options
)
Public Sub AddReferencePlane (
	refPlane As Plane,
	options As DirectShapeReferenceOptions
)
public:
void AddReferencePlane(
	Plane^ refPlane,
	DirectShapeReferenceOptions^ options
)
member AddReferencePlane :
        refPlane : Plane *
        options : DirectShapeReferenceOptions -> unit
Parameters
refPlane Plane
 The geometry of the new reference plane.
options DirectShapeReferenceOptions
 The options that are used to configure the new reference plane.
Exceptions
Exception | Condition
ArgumentException |  options cannot be used to add a reference object to this DirectShapeType.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeType Class
AddReferencePlane Overload
Autodesk.Revit.DB Namespace